БухЭксп/InformationRegisters/CW_ПраваДоступаДляПараметровМониторинга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПраваДоступаДляПараметровМониторинга</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Просмотр</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Редактирование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Группа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Catalogs/CW_МониторинговыеПараметрыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_МониторинговыеПараметрыОбъектов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.CW_Коносаменты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПлан</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеФакт</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексЭлемента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторГруппы</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сворачивать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_МониторинговыеПараметрыТиповОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_МониторинговыеПараметрыТиповОбъектов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.CW_ТипыКоносаментов</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сворачивать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексЭлемента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КопироватьВГрузоперевозки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КопироватьВЗаказы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonModules/CW_МониторинговыеПараметрыСервер/Ext/Module.bsl
//CW_МониторинговыеПараметрыСервер.ПолучитьИндексПиктограммыПараметра(Ссылка)
Функция ПолучитьИндексПиктограммыТипаПараметра(Знач Ссылка) Экспорт
	
	Если Ссылка.ЭтоГруппа Тогда
		Возврат 14;
	КонецЕсли;  
	
	Если Ссылка.ЭтоКонтрольнаяДата Тогда
		Возврат 3;
	КонецЕсли;  
	
	Если Ссылка.ДинамическийПараметр Тогда
		Возврат 12;
	КонецЕсли;
	
	Возврат ВариантыОтчетовСлужебныйКлиентСервер.ИндексКартинкиПоля(Ссылка.ТипЗначения);

КонецФункции

Функция ПолучитьИндексПиктограммыПараметраОбъекта(Знач Ссылка) Экспорт 
	
	Если ТипЗнч(Ссылка) = Тип("ПланВидовХарактеристикСсылка.CW_ПараметрыГрузоперевозок") Тогда
		Параметр = Ссылка;	
	Иначе
		Параметр = Ссылка.Параметр;	
	КонецЕсли;
	
	Если Ссылка.ЭтоГруппа Тогда
		Возврат 0;
	КонецЕсли;  
	
	Если Параметр.ЭтоКонтрольнаяДата Тогда
		Возврат 2;
	КонецЕсли;  
	
	Если Параметр.ДинамическийПараметр Тогда
		Возврат 3;
	КонецЕсли;  
	
	Если Параметр.ТипЗначения.СодержитТип(Тип("Дата")) Тогда
		Возврат 4;
	КонецЕсли;  
	
	Возврат 1;

КонецФункции

Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт 
	
	Объект = Форма.Объект;
	Ссылка = Форма.Объект.Ссылка;     
	
	Форма.ЗначениеКопирования = Форма.Параметры.ЗначениеКопирования;
	
	Если CW_МониторинговыеПараметрыСерверПовторноеИспользование.ЯвляетсяОбъектомПараметров(Ссылка) Тогда 
		СтруктураДоступныхПарамтеров = CW_МониторинговыеПараметрыСерверПовторноеИспользование.ПолучитьДоступныеПараметры();
		Если ТипЗнч(СтруктураДоступныхПарамтеров) = Тип("Структура") Тогда
			Форма.ДоступныеПараметры  = Новый ФиксированнаяСтруктура(СтруктураДоступныхПарамтеров);
		КонецЕсли;  
		
		УстановитьУсловноеФОрмилениеСпискаМониторинговыхПараметров(Форма);  
		
	КонецЕсли;
	
	УстановитьОтборСпискаМониторинговыхПараметров(Форма, Ссылка);
	
КонецПроцедуры

Процедура ПослеЗаписиНаСервере(Форма, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	Ссылка = Форма.Объект.Ссылка;   
	
	Если ЗначениеЗаполнено(Форма.ЗначениеКопирования) Тогда
		СкопироватьМониторинговыеПараметрыОбъекта(Ссылка, Форма.ЗначениеКопирования);	
	КонецЕсли;
	
	УстановитьОтборСпискаМониторинговыхПараметров(Форма, Ссылка);
	
КонецПроцедуры  

Процедура СкопироватьМониторинговыеПараметрыОбъекта(Владелец, ЗначениеКопирования) 

	ИмяСправочника = CW_МониторинговыеПараметрыСерверПовторноеИспользование.ПолучитьИмяСправочникаМониторинговыхПараметров(Владелец);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МониторинговыеПараметры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник."+ИмяСправочника+" КАК МониторинговыеПараметры
	|ГДЕ
	|	МониторинговыеПараметры.Владелец = &Владелец
	|	И МониторинговыеПараметры.ЭтоГруппа = ЛОЖЬ"; 
	
	Запрос.УстановитьПараметр("Владелец", ЗначениеКопирования);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	СоответствиеГрупп = Новый Соответствие;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл  
		СкопироватьМониторинговыйПараметр(Выборка.Ссылка, Владелец, СоответствиеГрупп);
	КонецЦикла; 
	
КонецПроцедуры

Функция СкопироватьМониторинговыйПараметр(Знач ЗначениеКопироваяния, Знач Владелец, СоответствиеГрупп)
	
	ИмяСправочника 	= CW_МониторинговыеПараметрыСерверПовторноеИспользование.ПолучитьИмяСправочникаМониторинговыхПараметров(Владелец);
	СcылкаНового 	= Справочники[ИмяСправочника].ПолучитьСсылку(Новый УникальныйИдентификатор);
	
	НовыйЭлемент = ЗначениеКопироваяния.Скопировать();
	НовыйЭлемент.УстановитьНовыйКод();
	НовыйЭлемент.Владелец = Владелец;
	
	Если ЗначениеЗаполнено(ЗначениеКопироваяния.Родитель) Тогда   
		НовыйРодитель = СоответствиеГрупп.Получить(ЗначениеКопироваяния.Родитель);
		Если НовыйРодитель = Неопределено Тогда
			НовыйРодитель = СкопироватьМониторинговыйПараметр(НовыйЭлемент.Родитель, Владелец, СоответствиеГрупп); 
		КонецЕсли;

		СоответствиеГрупп.Вставить(ЗначениеКопироваяния.Родитель, НовыйРодитель);

		НовыйЭлемент.Родитель = НовыйРодитель;
	КонецЕсли;
	
	НовыйЭлемент.УстановитьСсылкуНового(СcылкаНового);
	НовыйЭлемент.ОбменДанными.Загрузка = Истина;
	НовыйЭлемент.Записать(); 
	
	Возврат СcылкаНового;

КонецФункции

Процедура УстановитьОтборСпискаМониторинговыхПараметров(Форма, Ссылка) 
	
	Форма.МониторинговыеПараметры.Отбор.Элементы.Очистить();
	
	ПравоеЗначение = ?(Ссылка.Пустая(), Неопределено, Ссылка);
	
	ЭлементОтбора = Форма.МониторинговыеПараметры.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Владелец");
	ЭлементОтбора.ВидСравнения  	= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение  	= ПравоеЗначение;
	ЭлементОтбора.Использование 	= Истина;  
	
	Если CW_МониторинговыеПараметрыСерверПовторноеИспользование.ЯвляетсяОбъектомПараметров(Ссылка) Тогда 
		Если ТипЗнч(Форма.ДоступныеПараметры) = Тип("ФиксированнаяСтруктура") 
			И Форма.ДоступныеПараметры.Свойство("Просмотр") Тогда
			
			СписокПараметров = Новый СписокЗначений;
			СписокПараметров.ЗагрузитьЗначения(Форма.ДоступныеПараметры.Просмотр);
			
			ЭлементОтбора = Форма.МониторинговыеПараметры.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Параметр");
			ЭлементОтбора.ВидСравнения  	= ВидСравненияКомпоновкиДанных.ВСписке;
			ЭлементОтбора.ПравоеЗначение  	= СписокПараметров;
			ЭлементОтбора.Использование 	= Истина;  
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура УстановитьУсловноеФОрмилениеСпискаМониторинговыхПараметров(Форма)
	
	//ГоризонтальноеПоложение
	ЭлементОформления = Форма.МониторинговыеПараметры.УсловноеОформление.Элементы.Добавить();
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементОформления.Поля, "Значение");
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ГоризонтальноеПоложение", ГоризонтальноеПоложение.Лево);     
	//ГоризонтальноеПоложение
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ПараметрыГрузоперевозок.Ссылка КАК Параметр,
	|	ВЫРАЗИТЬ(CW_ПараметрыГрузоперевозок.ФорматВывода КАК СТРОКА(150)) КАК ФорматВывода,
	|	CW_ПараметрыГрузоперевозок.ЭтоКонтрольнаяДата КАК КонтрольнаяДата
	|ПОМЕСТИТЬ ВТ_ВсеПараметры
	|ИЗ
	|	ПланВидовХарактеристик.CW_ПараметрыГрузоперевозок КАК CW_ПараметрыГрузоперевозок
	|ГДЕ
	|	CW_ПараметрыГрузоперевозок.ЭтоСсылочныйТип = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Параметры.Параметр КАК Параметр,
	|	ВТ_Параметры.ФорматВывода КАК ФорматВывода,
	|	ВТ_Параметры.КонтрольнаяДата КАК КонтрольнаяДата
	|ИЗ
	|	ВТ_ВсеПараметры КАК ВТ_Параметры
	|ГДЕ
	|	ВТ_Параметры.ФорматВывода <> """""; 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 
		
		ЭлементОформления = Форма.МониторинговыеПараметры.УсловноеОформление.Элементы.Добавить();
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементОформления.Поля, "Значение");
		
		Если Выборка.КонтрольнаяДата Тогда
			КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементОформления.Поля, "ЗначениеПлан"); 
			КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементОформления.Поля, "ЗначениеФакт"); 
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементОформления.Отбор,
		"Параметр", ВидСравненияКомпоновкиДанных.Равно, Выборка.Параметр);
		
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Формат", Выборка.ФорматВывода);
		
	КонецЦикла;  
	
	//Доступность
	ГруппаПользовтеля = CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь);

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_ПраваДоступаДляПараметровМониторинга.Параметр КАК Параметр,
	|	CW_ПраваДоступаДляПараметровМониторинга.Редактирование КАК Редактирование
	|ИЗ
	|	РегистрСведений.CW_ПраваДоступаДляПараметровМониторинга КАК CW_ПраваДоступаДляПараметровМониторинга
	|ГДЕ
	|	CW_ПраваДоступаДляПараметровМониторинга.Группа = &ГруппаПользовтеля
	|	И CW_ПраваДоступаДляПараметровМониторинга.Редактирование = ЛОЖЬ";  
	
	Запрос.УстановитьПараметр("ГруппаПользовтеля", ГруппаПользовтеля);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 
		
		ЭлементОформления = Форма.МониторинговыеПараметры.УсловноеОформление.Элементы.Добавить();
		
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементОформления.Отбор,
		"Параметр", ВидСравненияКомпоновкиДанных.Равно, Выборка.Параметр);
		
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("Доступность", ЛОЖЬ);
		
		ЭлементОформления = Форма.МониторинговыеПараметры.УсловноеОформление.Элементы.Добавить();
		КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементОформления.Поля, "Ссылка");
	
		ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементОформления.Отбор,
		"Параметр", ВидСравненияКомпоновкиДанных.Равно, Выборка.Параметр);
		
		ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(192,192,192));
		
	КонецЦикла;  
	
КонецПроцедуры  

// Функция - Получить пустую структуру редактирования параметров
// 
// Возвращаемое значение:
//   - Структура для заполнения строки параметров
//
Функция ПолучитьПустуюСтруктуруРедактированияПараметров() Экспорт
	
	Структура = Новый Структура;
	Структура.Вставить("Параметр",   		Неопределено);
	Структура.Вставить("Значение",			Неопределено);
	Структура.Вставить("ЗначениеПлан", 		Дата(1,1,1));
	Структура.Вставить("ЗначениеФакт", 		Дата(1,1,1));
	Структура.Вставить("ХранилищеДанных",	Неопределено);
	Структура.Вставить("ПолноеЗначение",	"");
	Структура.Вставить("ПараметрИзменен",	Ложь);
	Структура.Вставить("Примечание",   		"");
	
	Возврат Структура;
	
КонецФункции


Процедура ДобавитьМониторинговыйПараметрОбъекта(МониторинговыйПарамтер, ДополнительныеПараметры) Экспорт
	
	ИмяСправочника = CW_МониторинговыеПараметрыСерверПовторноеИспользование.ПолучитьИмяСправочникаМониторинговыхПараметров(ДополнительныеПараметры.Владелец);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	МониторинговыеПараметры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник."+ИмяСправочника+" КАК МониторинговыеПараметры
	|ГДЕ
	|	МониторинговыеПараметры.Владелец = &Владелец
	|	И МониторинговыеПараметры.Параметр = &Параметр";   
	
	Запрос.УстановитьПараметр("Владелец",	ДополнительныеПараметры.Владелец);
	Запрос.УстановитьПараметр("Параметр",	МониторинговыйПарамтер);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	Если Не РезультатЗапроса.Пустой() Тогда
		ВызватьИсключение "Параметр "+СокрЛП(МониторинговыйПарамтер)+" уже добавлен!";
	КонецЕсли;
	
	НовыйЭлемент = Справочники[ИмяСправочника].СоздатьЭлемент();
	НовыйЭлемент.Владелец 		 = ДополнительныеПараметры.Владелец;
	НовыйЭлемент.Родитель 		 = ДополнительныеПараметры.Родитель;
	НовыйЭлемент.Наименование 	 = СокрЛП(МониторинговыйПарамтер);
	НовыйЭлемент.Параметр 		 = МониторинговыйПарамтер;
	НовыйЭлемент.Записать();
	
КонецПроцедуры  

Процедура ВыполнитьПеремещениеЭлемента(СправочникСсылка, Направление) Экспорт
	
	ИмяСправочника = CW_МониторинговыеПараметрыСерверПовторноеИспользование.ПолучитьИмяСправочника(СправочникСсылка);
	
	СправочникОбъект = СправочникСсылка.ПолучитьОбъект();
	
	ИндексЭлемента = СправочникОбъект.ИндексЭлемента + Направление;
	Если ИндексЭлемента < 1 Тогда
		ИндексЭлемента = 1;
	КонецЕсли;
	
	СправочникОбъект.ИндексЭлемента = ИндексЭлемента;
	СправочникОбъект.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	МониторинговыеПараметры.Ссылка КАК Ссылка,
	|	МониторинговыеПараметры.Владелец КАК Владелец,
	|	МониторинговыеПараметры.Родитель КАК Родитель,
	|	МониторинговыеПараметры.ИндексЭлемента КАК ИндексЭлемента
	|ИЗ
	|	Справочник."+ИмяСправочника+" КАК МониторинговыеПараметры
	|ГДЕ
	|	МониторинговыеПараметры.ИндексЭлемента = &ИндексЭлемента
	|	И МониторинговыеПараметры.Ссылка <> &Ссылка
	|	И МониторинговыеПараметры.Владелец = &Владелец
	|	И МониторинговыеПараметры.Родитель = &Родитель
	|	И МониторинговыеПараметры.ЭтоГруппа = &ЭтоГруппа";   
	
	Запрос.УстановитьПараметр("Владелец", 			СправочникСсылка.Владелец);
	Запрос.УстановитьПараметр("Родитель", 			СправочникСсылка.Родитель);
	Запрос.УстановитьПараметр("Ссылка", 			СправочникСсылка); 
	Запрос.УстановитьПараметр("ИндексЭлемента", 	ИндексЭлемента); 
	Запрос.УстановитьПараметр("ЭтоГруппа", 			СправочникСсылка.ЭтоГруппа); 
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		
		
		СправочникОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		ИндексЭлемента = СправочникОбъект.ИндексЭлемента - Направление;
		Если ИндексЭлемента < 1 Тогда
			ИндексЭлемента = 1;
		КонецЕсли;
		
		СправочникОбъект.ИндексЭлемента = ИндексЭлемента;
		СправочникОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьГруппыПараметровОбъекта(Владелец) Экспорт
	
	ИмяСправочника = CW_МониторинговыеПараметрыСерверПовторноеИспользование.ПолучитьИмяСправочникаМониторинговыхПараметров(Владелец);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МониторинговыеПараметры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник."+ИмяСправочника+" КАК МониторинговыеПараметры
	|ГДЕ
	|	МониторинговыеПараметры.Владелец = &Владелец
	|	И МониторинговыеПараметры.ЭтоГруппа = ИСТИНА";   
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Возврат РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция ПолучитьНастройкиГруппПараметровОбъекта(Владелец) Экспорт
	
	ИмяСправочника = CW_МониторинговыеПараметрыСерверПовторноеИспользование.ПолучитьИмяСправочникаМониторинговыхПараметров(Владелец);
	
	НастройкиГрупп = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МониторинговыеПараметры.Ссылка КАК Ссылка,
	|	МониторинговыеПараметры.Сворачивать КАК Сворачивать
	|ИЗ
	|	Справочник."+ИмяСправочника+" КАК МониторинговыеПараметры
	|ГДЕ
	|	МониторинговыеПараметры.Владелец = &Владелец
	|	И МониторинговыеПараметры.ЭтоГруппа = ИСТИНА";   
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	
	РезультатЗапроса = Запрос.Выполнить();  
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НастройкиГрупп.Вставить(Выборка.Ссылка,  Выборка.Сворачивать);	
	КонецЦикла;
	
	Возврат НастройкиГрупп;
	
КонецФункции

Функция ЕстьПараметрыОбъекта(Владелец) Экспорт
	
	ИмяСправочника = CW_МониторинговыеПараметрыСерверПовторноеИспользование.ПолучитьИмяСправочникаМониторинговыхПараметров(Владелец);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	|	МониторинговыеПараметры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник."+ИмяСправочника+" КАК МониторинговыеПараметры
	|ГДЕ
	|	МониторинговыеПараметры.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат Не РезультатЗапроса.Пустой();
	
КонецФункции


Функция НачатьЗаполнениеПараметровВФоне(ПараметрыПроцедуры) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение    = 0;  // запускать сразу  
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "";  
	ПараметрыВыполнения.ЗапуститьВФоне     = Истина;  
	ПараметрыВыполнения.ЗапуститьНеВФоне    = ложь;   
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("CW_МониторинговыеПараметрыСервер.ВыполнитьЗаполнениеПараметровПоТипу",ПараметрыПроцедуры, ПараметрыВыполнения);  
	
	
КонецФункции    

Процедура ВыполнитьЗаполнениеПараметровПоТипу(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	//ВариантЗаполнения
	// 0 - перенести новую структуру параметров, оставить несоответствующие параметры, 
	// 1 - перенести новую структуру параметров, удалить несоответствующие параметры,
	// 2 - сохранить текущую структуру, добавить новые параметры
	
	ВариантЗаполнения =  ПараметрыПроцедуры.ВариантЗаполнения; 
	
	//Параметры объекта  
	СоответствиеЗначенийПараметров = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МониторинговыеПараметры.Параметр КАК Параметр,
	|	МониторинговыеПараметры.Значение КАК Значение,
	|	МониторинговыеПараметры.ЗначениеПлан КАК ЗначениеПлан,
	|	МониторинговыеПараметры.ЗначениеФакт КАК ЗначениеФакт
	|ИЗ
	|	Справочник.CW_МониторинговыеПараметрыОбъектов КАК МониторинговыеПараметры
	|ГДЕ
	|	МониторинговыеПараметры.Владелец = &Владелец
	|	И МониторинговыеПараметры.ЭтоГруппа = ЛОЖЬ";  
	
	Запрос.УстановитьПараметр("Владелец", ПараметрыПроцедуры.Владелец);
	
	РезультатЗапросаПоОбъекту = Запрос.Выполнить();   
	
	Выборка = РезультатЗапросаПоОбъекту.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СтруктураЗначения = CW_МониторинговыеПараметрыСервер.ПолучитьПустуюСтруктуруРедактированияПараметров();
		СтруктураЗначения.Значение 		= Выборка.Значение;
		СтруктураЗначения.ЗначениеПлан 	= Выборка.ЗначениеПлан;
		СтруктураЗначения.ЗначениеФакт 	= Выборка.ЗначениеФакт;
		
		СоответствиеЗначенийПараметров.Вставить(Выборка.Параметр, СтруктураЗначения); 
	КонецЦикла; 
	
	Если ВариантЗаполнения = 0 Тогда
		ВыполнитьЗаполнениеПоПервомуВарианту( ПараметрыПроцедуры, СоответствиеЗначенийПараметров);
	КонецЕсли;
	Если ВариантЗаполнения = 1 Тогда
		ВыполнитьЗаполнениеПоВторомуВарианту( ПараметрыПроцедуры, СоответствиеЗначенийПараметров);
	КонецЕсли;
	Если ВариантЗаполнения = 2 Тогда
		ВыполнитьЗаполнениеПоТретьемуВарианту( ПараметрыПроцедуры, СоответствиеЗначенийПараметров);
	КонецЕсли;
	
КонецПроцедуры 

Процедура ВыполнитьЗаполнениеПоПервомуВарианту(Знач ПараметрыПроцедуры, Знач СоответствиеЗначенийПараметров)
	
	// 0 - перенести новую структуру параметров, оставить несоответствующие параметры, 
	УдалитьПараметрыОбъекта(ПараметрыПроцедуры.Владелец);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МониторинговыеПараметры.ЭтоГруппа КАК ЭтоГруппа,
	|	МониторинговыеПараметры.Наименование КАК Наименование,
	|	МониторинговыеПараметры.Родитель КАК Родитель,
	|	МониторинговыеПараметры.Сворачивать КАК Сворачивать,
	|	МониторинговыеПараметры.Параметр КАК Параметр,
	|	МониторинговыеПараметры.Ссылка КАК Ссылка,
	|	МониторинговыеПараметры.ИндексЭлемента КАК ИндексЭлемента,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(МониторинговыеПараметры.Ссылка) КАК УникальныйИдентификатор
	|ИЗ
	|	Справочник.CW_МониторинговыеПараметрыТиповОбъектов КАК МониторинговыеПараметры
	|ГДЕ
	|	МониторинговыеПараметры.Владелец = &ТипОбъекта
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтоГруппа УБЫВ,
	|	Родитель";
	
	Запрос.УстановитьПараметр("ТипОбъекта", ПараметрыПроцедуры.ТипОбъекта);
	РезультатЗапросаПоТипу = Запрос.Выполнить();   
	
	СоответствиеПараметров = Новый Соответствие;  
	
	мДобавленныеПараметры = Новый Массив;
	
	Выборка = РезультатЗапросаПоТипу.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		
		Если Выборка.ЭтоГруппа Тогда
			НайденныйЭлемент = Справочники.CW_МониторинговыеПараметрыОбъектов.НайтиПоРеквизиту(
			"ИдентификаторГруппы", 
			Выборка.УникальныйИдентификатор,, 
			ПараметрыПроцедуры.Владелец);	
		Иначе	
			НайденныйЭлемент = Справочники.CW_МониторинговыеПараметрыОбъектов.НайтиПоРеквизиту(
			"Параметр",
			Выборка.Параметр,,
			ПараметрыПроцедуры.Владелец);	
		КонецЕсли; 
		
		Если НайденныйЭлемент.Пустая() Тогда  
			Если Выборка.ЭтоГруппа Тогда
				НовыйЭлемент = Справочники.CW_МониторинговыеПараметрыОбъектов.СоздатьГруппу();
				НовыйЭлемент.Владелец = ПараметрыПроцедуры.Владелец;
			Иначе
				НовыйЭлемент = Справочники.CW_МониторинговыеПараметрыОбъектов.СоздатьЭлемент();
				НовыйЭлемент.Владелец = ПараметрыПроцедуры.Владелец;    
				
			КонецЕсли;
		Иначе
			НовыйЭлемент = НайденныйЭлемент.ПолучитьОбъект();
		КонецЕсли;
		
		НовыйЭлемент.ИндексЭлемента	= Выборка.ИндексЭлемента;
		НовыйЭлемент.Наименование 	= Выборка.Наименование;
		НовыйЭлемент.Родитель 		= СоответствиеПараметров.Получить(Выборка.Родитель); 
		
		Если Выборка.ЭтоГруппа Тогда
			НовыйЭлемент.Сворачивать 			= Выборка.Сворачивать;  
			НовыйЭлемент.ИдентификаторГруппы	= Выборка.УникальныйИдентификатор;
		Иначе     
			НовыйЭлемент.Параметр = Выборка.Параметр; 
			
			СтруктураЗначения = СоответствиеЗначенийПараметров.Получить(Выборка.Параметр);
			Если СтруктураЗначения <> Неопределено Тогда
				НовыйЭлемент.Значение 		= СтруктураЗначения.Значение;  
				НовыйЭлемент.ЗначениеПлан 	= СтруктураЗначения.ЗначениеПлан;  
				НовыйЭлемент.ЗначениеФакт 	= СтруктураЗначения.ЗначениеФакт;
			Иначе
				ТипЗначения = Выборка.Параметр.ТипЗначения;
				
				НовыйЭлемент.Значение = ТипЗначения.ПривестиЗначение(Неопределено);   
				Если Выборка.Параметр.ЭтоКонтрольнаяДата Тогда
					НовыйЭлемент.ЗначениеПлан = ТипЗначения.ПривестиЗначение(Неопределено);   
					НовыйЭлемент.ЗначениеФакт = ТипЗначения.ПривестиЗначение(Неопределено);   
				КонецЕсли;
			КонецЕсли;
			
			мДобавленныеПараметры.Добавить(Выборка.Параметр);
			
		КонецЕсли;
		
		
		НовыйЭлемент.ОбменДанными.Загрузка = Истина;
		НовыйЭлемент.Записать();
		
		СоответствиеПараметров.Вставить(Выборка.Ссылка, НовыйЭлемент.Ссылка);
		
	КонецЦикла;  
	
	//Добавляем парамтеры, которых нет в типе перевозки в корень
	Для Каждого КлючЗначение из СоответствиеЗначенийПараметров Цикл
		
		Если мДобавленныеПараметры.Найти(КлючЗначение.Ключ) = Неопределено Тогда
			МониторинговыйПарамтер 	= КлючЗначение.Ключ;
			СтруктураЗначения 		= КлючЗначение.Значение; 
			
			НовыйЭлемент = Справочники.CW_МониторинговыеПараметрыОбъектов.СоздатьЭлемент();
			НовыйЭлемент.Владелец 		 = ПараметрыПроцедуры.Владелец;
			НовыйЭлемент.Наименование 	 = СокрЛП(МониторинговыйПарамтер);
			НовыйЭлемент.Параметр 		 = МониторинговыйПарамтер; 
			
			НовыйЭлемент.Значение 		= СтруктураЗначения.Значение;  
			НовыйЭлемент.ЗначениеПлан 	= СтруктураЗначения.ЗначениеПлан;  
			НовыйЭлемент.ЗначениеФакт 	= СтруктураЗначения.ЗначениеФакт;  
			
			НовыйЭлемент.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ВыполнитьЗаполнениеПоВторомуВарианту(Знач ПараметрыПроцедуры, Знач СоответствиеЗначенийПараметров)
	
	// 1 - перенести новую структуру параметров, удалить несоответствующие параметры,
	
	УдалитьПараметрыОбъекта(ПараметрыПроцедуры.Владелец);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МониторинговыеПараметры.ЭтоГруппа КАК ЭтоГруппа,
	|	МониторинговыеПараметры.Наименование КАК Наименование,
	|	МониторинговыеПараметры.Родитель КАК Родитель,
	|	МониторинговыеПараметры.Сворачивать КАК Сворачивать,
	|	МониторинговыеПараметры.Параметр КАК Параметр,
	|	МониторинговыеПараметры.Ссылка КАК Ссылка,
	|	МониторинговыеПараметры.ИндексЭлемента КАК ИндексЭлемента,
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(МониторинговыеПараметры.Ссылка) КАК УникальныйИдентификатор
	|ИЗ
	|	Справочник.CW_МониторинговыеПараметрыТиповОбъектов КАК МониторинговыеПараметры
	|ГДЕ
	|	МониторинговыеПараметры.Владелец = &ТипОбъекта
	|
	|УПОРЯДОЧИТЬ ПО
	|	ЭтоГруппа УБЫВ,
	|	Родитель";
	
	Запрос.УстановитьПараметр("ТипОбъекта", ПараметрыПроцедуры.ТипОбъекта);
	РезультатЗапросаПоТипу = Запрос.Выполнить();   
	
	СоответствиеПараметров = Новый Соответствие;
	
	Выборка = РезультатЗапросаПоТипу.Выбрать(); 
	Пока Выборка.Следующий() Цикл 
		
		Если Выборка.ЭтоГруппа Тогда
			НайденныйЭлемент = Справочники.CW_МониторинговыеПараметрыОбъектов.НайтиПоРеквизиту(
			"ИдентификаторГруппы", 
			Выборка.УникальныйИдентификатор,, 
			ПараметрыПроцедуры.Владелец);	
		Иначе	
			НайденныйЭлемент = Справочники.CW_МониторинговыеПараметрыОбъектов.НайтиПоРеквизиту(
			"Параметр",
			Выборка.Параметр,,
			ПараметрыПроцедуры.Владелец);	
		КонецЕсли; 
		
		Если НайденныйЭлемент.Пустая() Тогда  
			Если Выборка.ЭтоГруппа Тогда
				НовыйЭлемент = Справочники.CW_МониторинговыеПараметрыОбъектов.СоздатьГруппу();
				НовыйЭлемент.Владелец = ПараметрыПроцедуры.Владелец;
			Иначе
				НовыйЭлемент = Справочники.CW_МониторинговыеПараметрыОбъектов.СоздатьЭлемент();
				НовыйЭлемент.Владелец = ПараметрыПроцедуры.Владелец;
			КонецЕсли;
		Иначе
			НовыйЭлемент = НайденныйЭлемент.ПолучитьОбъект();
		КонецЕсли;
		
		НовыйЭлемент.ИндексЭлемента	= Выборка.ИндексЭлемента;
		НовыйЭлемент.Наименование 	= Выборка.Наименование;
		НовыйЭлемент.Родитель 		= СоответствиеПараметров.Получить(Выборка.Родитель); 
		
		Если Выборка.ЭтоГруппа Тогда
			НовыйЭлемент.Сворачивать 			= Выборка.Сворачивать;  
			НовыйЭлемент.ИдентификаторГруппы	= Выборка.УникальныйИдентификатор;
		Иначе     
			НовыйЭлемент.Параметр = Выборка.Параметр;
			
			СтруктураЗначения = СоответствиеЗначенийПараметров.Получить(Выборка.Параметр);
			Если СтруктураЗначения <> Неопределено Тогда
				НовыйЭлемент.Значение 		= СтруктураЗначения.Значение;  
				НовыйЭлемент.ЗначениеПлан 	= СтруктураЗначения.ЗначениеПлан;  
				НовыйЭлемент.ЗначениеФакт 	= СтруктураЗначения.ЗначениеФакт; 
				
			Иначе  
				ТипЗначения = Выборка.Параметр.ТипЗначения;
				
				НовыйЭлемент.Значение = ТипЗначения.ПривестиЗначение(Неопределено);   
				Если Выборка.Параметр.ЭтоКонтрольнаяДата Тогда
					НовыйЭлемент.ЗначениеПлан = ТипЗначения.ПривестиЗначение(Неопределено);   
					НовыйЭлемент.ЗначениеФакт = ТипЗначения.ПривестиЗначение(Неопределено);   
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;  
		
		НовыйЭлемент.ОбменДанными.Загрузка = Истина;
		НовыйЭлемент.Записать();
		
		СоответствиеПараметров.Вставить(Выборка.Ссылка, НовыйЭлемент.Ссылка);
		
	КонецЦикла;
	
КонецПроцедуры   

Процедура ВыполнитьЗаполнениеПоТретьемуВарианту(Знач ПараметрыПроцедуры, Знач СоответствиеЗначенийПараметров)
	
	// 2 - сохранить текущую структуру, добавить новые параметры
	МассивПараметровОбъекта = Новый Массив;
	Для Каждого КлючЗначение из СоответствиеЗначенийПараметров Цикл
		МассивПараметровОбъекта.Добавить(КлючЗначение.Ключ);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	МониторинговыеПараметры.Параметр КАК Параметр
	|ИЗ
	|	Справочник.CW_МониторинговыеПараметрыТиповОбъектов КАК МониторинговыеПараметры
	|ГДЕ
	|	МониторинговыеПараметры.Владелец = &ТипОбъекта
	|	И МониторинговыеПараметры.ЭтоГруппа = ЛОЖЬ
	|	И НЕ МониторинговыеПараметры.Параметр В (&ПараметрыОбъекта)";
	
	Запрос.УстановитьПараметр("ТипОбъекта", 		ПараметрыПроцедуры.ТипОбъекта);
	Запрос.УстановитьПараметр("ПараметрыОбъекта", 	МассивПараметровОбъекта);
	
	РезультатЗапроса = Запрос.Выполнить();   
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		НовыйЭлемент = Справочники.CW_МониторинговыеПараметрыОбъектов.СоздатьЭлемент();
		НовыйЭлемент.Владелец 		 = ПараметрыПроцедуры.Владелец;
		НовыйЭлемент.Наименование 	 = СокрЛП(Выборка.Параметр);
		НовыйЭлемент.Параметр 		 = Выборка.Параметр; 
		НовыйЭлемент.Записать();
		
	КонецЦикла;
	
КонецПроцедуры


Процедура УдалитьПараметрыОбъекта(ОбъектПарамтеров)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_МониторинговыеПараметрыОбъектов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.CW_МониторинговыеПараметрыОбъектов КАК CW_МониторинговыеПараметрыОбъектов
	|ГДЕ
	|	CW_МониторинговыеПараметрыОбъектов.Владелец = &Владелец";
	
	Запрос.УстановитьПараметр("Владелец", ОбъектПарамтеров);
	
	РезультатЗапросаПоОбъекту = Запрос.Выполнить();   
	
	Выборка = РезультатЗапросаПоОбъекту.Выбрать();
	Пока Выборка.Следующий() Цикл                          
		ПараметрОбъект = Выборка.Ссылка.ПолучитьОбъект();   
		Если ПараметрОбъект <> Неопределено Тогда
			ПараметрОбъект.Удалить();                
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры


Функция НачатьПереименованиеСвязанныхПараметровВФоне(МониторинговыйПараметр=Неопределено) Экспорт

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение    = 0;  // запускать сразу  
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Переименование связанных параметров";  
	ПараметрыВыполнения.ЗапуститьВФоне      = Истина;  
	ПараметрыВыполнения.ЗапуститьНеВФоне    = ложь;  
	
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("МониторинговыйПараметр", МониторинговыйПараметр);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("CW_МониторинговыеПараметрыСервер.ВыполнитьПереименованиеСвязанныхПараметров",ПараметрыПроцедуры, ПараметрыВыполнения);  
	
КонецФункции 

Процедура ВыполнитьПереименованиеСвязанныхПараметров(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_МониторинговыеПараметрыОбъектов.Ссылка КАК Ссылка,
	|	CW_МониторинговыеПараметрыОбъектов.Параметр КАК Параметр,
	|	CW_МониторинговыеПараметрыОбъектов.Параметр.Наименование КАК Наименование
	|ИЗ
	|	Справочник.CW_МониторинговыеПараметрыОбъектов КАК CW_МониторинговыеПараметрыОбъектов
	|ГДЕ
	|	CW_МониторинговыеПараметрыОбъектов.Наименование <> CW_МониторинговыеПараметрыОбъектов.Параметр.Наименование
	|	//%1
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	CW_МониторинговыеПараметрыТиповОбъектов.Ссылка,
	|	CW_МониторинговыеПараметрыТиповОбъектов.Параметр,
	|	CW_МониторинговыеПараметрыТиповОбъектов.Наименование
	|ИЗ
	|	Справочник.CW_МониторинговыеПараметрыТиповОбъектов КАК CW_МониторинговыеПараметрыТиповОбъектов
	|ГДЕ
	|	CW_МониторинговыеПараметрыТиповОбъектов.Наименование = CW_МониторинговыеПараметрыТиповОбъектов.Параметр.Наименование  
	|	//%2";
	
	Если ПараметрыПроцедуры.МониторинговыйПараметр <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//%1", "И CW_МониторинговыеПараметрыОбъектов.Параметр = &Параметр");
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "//%2", "И CW_МониторинговыеПараметрыТиповОбъектов.Параметр = &Параметр");
		
		Запрос.УстановитьПараметр("Параметр", ПараметрыПроцедуры.МониторинговыйПараметр);
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл 
		ПараметрОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ПараметрОбъект.Наименование = СокрЛП(ПараметрыПроцедуры.МониторинговыйПараметр);
		ПараметрОбъект.ОбменДанными.Загрузка = Истина;
		ПараметрОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры



//ХранениеПолногоЗначения  
Функция ИспользуетсяСохранениеПолногоЗначения(Параметр) Экспорт
	Возврат Параметр.СохранятьПолноеЗначениеПараметра или Параметр.ИспользоватьФормуВводаАдреса;
КонецФункции
//---ХранениеПолногоЗначения
